pkg/wsman/wsmantesting/responses/cim/fan/get.xml

<?xml version="1.0" encoding="UTF-8"?>
<a:Envelope xmlns:a="http://www.w3.org/2003/05/soap-envelope"
    xmlns:b="http://schemas.xmlsoap.org/ws/2004/08/addressing"
    xmlns:c="http://schemas.dmtf.org/wbem/wsman/1/wsman.xsd"
    xmlns:d="http://schemas.xmlsoap.org/ws/2005/02/trust"
    xmlns:e="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"
    xmlns:f="http://schemas.dmtf.org/wbem/wsman/1/cimbinding.xsd"
    xmlns:g="http://schemas.dmtf.org/wbem/wscim/1/cim-schema/2/CIM_Fan"
    xmlns:h="http://schemas.dmtf.org/wbem/wscim/1/common"
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
    <a:Header>
        <b:To>http://schemas.xmlsoap.org/ws/2004/08/addressing/role/anonymous</b:To>
        <b:RelatesTo>0</b:RelatesTo>
        <b:Action a:mustUnderstand="true">http://schemas.xmlsoap.org/ws/2004/09/transfer/GetResponse</b:Action>
        <b:MessageID>uuid:00000000-8086-8086-8086-00000010008A</b:MessageID>
        <c:ResourceURI>http://schemas.dmtf.org/wbem/wscim/1/cim-schema/2/CIM_Fan</c:ResourceURI>
    </a:Header>
    <a:Body>
        <g:CIM_Fan>
            <g:ActiveCooling>true</g:ActiveCooling>
            <g:CreationClassName>CIM_Fan</g:CreationClassName>
            <g:DesiredSpeed>0</g:DesiredSpeed>
            <g:DeviceID>Fan 0</g:DeviceID>
            <g:ElementName>Fan</g:ElementName>
            <g:EnabledState>5</g:EnabledState>
            <g:HealthState>5</g:HealthState>
            <g:OperationalStatus>2</g:OperationalStatus>
            <g:RequestedState>12</g:RequestedState>
            <g:SystemCreationClassName>CIM_ComputerSystem</g:SystemCreationClassName>
            <g:SystemName>ManagedSystem</g:SystemName>
            <g:VariableSpeed>false</g:VariableSpeed>
        </g:CIM_Fan>
    </a:Body>
</a:Envelope>
